# PaddingLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PaddingLength Property
ParameterTypeId Class See Also
---
"Padding"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PaddingLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PaddingLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PaddingLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace